#Напиши програму, яка генерує випадкове число від 1 до 10.
#Користувач повинен вгадати це число.
#(при бажанні додай функціонал де - після кожного введеного числа,
#при програші, програма повідомляє - потрібне число було більше чи менше введеного)
#НЕ ЗАБУДЬ: пиши у коді коментарі - що, де і як працює, готуйся коментувати власний код на уроці.
import random
rand = random.randint(1,10)
#print(rand)
guess = int(input("Введіть ваше число\n"))
if guess == rand:
    print("Вітаю! Ви виграли!")
elif type(guess) == int:
#abs() - модуль(математичний)
    if abs(guess - rand) <= 2: #перевірка наскільки близько відповідь користувача до випадково числа
        if guess > rand:
            print("ваша відповідь була завелика, але ви були близько!")
        elif guess < rand:
            print("ваша відповідь була замала, але ви були близько!")

    elif 2 < abs(guess - rand) <= 5:
        if guess > rand:
            print("ваша відповідь була завелика")
        elif guess < rand:
            print("ваша відповідь була замала")

    else:
        if guess > rand:
            print("ваша відповідь була завелика і ви навіть не близько : (")
        elif guess < rand:
            print("ваша відповідь була замала і ви навіть не близько : (")
else:
    print("помилка")
